[
  {
    "key": "INPUTGEOMETRIESFILE",
    "casedKey": "inputGeometriesFile",
    "type": "<String> [<int> ...] [<String>]",
    "isForStandalone": true,
    "doc": "The pathname to the file containing the geometries of the chemical system/s given as input. Optionally, a set of integers can be used to select which geometries from a multigeometry input (0-based idex). Optionally, the string 'last' can be used to retain only the last geometry from a multigeometry input. "
  },
  {
    "key": "MULTIGEOMMODE",
    "casedKey": "multiGeomMode",
    "type": "<String>",
    "doc": "Defines how to interprete an input file containing multiple geometries. Possible values are IndependentJobs (to create an independent input file for each geometry) or AllInOneJob (to place all geometries in a single input file)."
  },
  {
    "key": "MULTIGEOMNAMES",
    "casedKey": "multiGeomNames",
    "type": "<String>",
    "doc": "Provides a space-separated list of strings to be used as geometry names. This overwrites the names imported from molecular structures file."
  },
  {
    "key": "JOBDETAILSFILE",
    "casedKey": "jobDetailsFile",
    "type": "<String>",
    "isForStandalone": true,
    "doc": "The pathname to a file defining the details of the job for which we are going to generate the input file/s."
  },
  {
    "key": "JOBDETAILS",
    "casedKey": "jobDetails",
    "type": "<String>",
    "doc": "The definition of the job for which we are going to generate the input file/s."
  },
  {
    "key": "ROOTPATHNAMEOUTPUT",
    "casedKey": "rootPathnameOutput",
    "type": "<String>",
    "doc": "The path+rootname of any input file for the job for which we are going to generate the input file/s."
  },
  {
    "key": "CHARGE",
    "casedKey": "charge",
    "type": "<int>",
    "doc": "Defines the charge of the chemical system/s given as input."
  },
  {
    "key": "SPIN_MULTIPLICITY",
    "casedKey": "spin_multiplicity",
    "type": "<int>",
    "doc": "Defines the spin multiplicity of the chemical system/s given as input."
  },
  {
    "key": "VERBOSITY",
    "casedKey": "verbosity",
    "type": "<int>",
    "isForStandalone": true,
    "doc": "Sets the amount of log messages. Values larger than 0 will make the worker write more and more detailed log reports."
  }
]
