[
  {
    "key": "SMARTS",
    "casedKey": "SMARTS",
    "type": "<String>",
    "doc": "Defines one or more SMARTS-based rules for generating conformational coordinates. Rules are separated by newline characters (i.e., each rule is defined in a single line). In each line, each space-separated string (i.e., a word) is interpreted as following: each word is considered a single SMARTS until a word is found that corresponds to any keyword (see below). Once the first keyword is found no more words will be interpreted as SMARTS. The order of the SMARTS is retained and used to generate the ordered tuple of atom indexes. Recognized keywords are (case-insensitive):\n --> 'Fold=<value>': to specify the extent to which this conformational coordinate should be explored (e.g., 2-fold, 3-fold, etc)\n --> 'GetCurrentValue': requests the determination of the value of the internal coordinate defined by the tuple: distance, angle, or dihedral angle.\n --> 'Value=<number>': to specify a value to assign to the conformational coordinate independently from the current value.\n --> 'OnlyBonded': limits to tuples of atoms to those that are connected to form a path visiting the tuple in the orded given by the order of the SMARTS. For example, a SMARTS-based rule for tuple '[#1] [#6] [#7]' may be limited to match only substructures where the H atom is connected with any bond to the C atom, which is connected with any bond to the N atom.\n --> 'Steps=[<int>,...]': to specify which steps to take along this kind of conformational coordinate. The magnitude of the step is defined by the fold. For example, a torsion-kind of coordinate with fold=4 has the step length is 90 DEG, so Steps=[2,3] specifies to twist the corresponding bond by 180 and 270 DEG. By defaule no step is specifies, meaning that all steps will be considered.\n --> 'getAtomLabels': request the generation of formatted atom labels to be used when reporting the atom tuple defined by the specific rule that contains this keyword. This keyword activates all the keywords associated with the 'GenerateAtomLabels' task.\n --> 'Prefix=<text with spaces>': to specify a text to be placed before the list of atom indexes.\n --> 'Suffix=<text with spaces>': to specify text to be placed after the list of atom indexes)."
  },
  {
    "key": "ATOMIDS",
    "casedKey": "atomIDs",
    "type": "<String>",
    "doc": "Defines one or more (0-based) index-based rules for generating conformational coordinates. Rules are separated by newline characters (i.e., each rule is defined in a single line). In each line, each space-separated string (i.e., a word) is interpreted as following: each word is considered a single index until a word is found that corresponds to any keyword (see below). Once the first keyword is found no more words will be interpreted as an index. The order of the indexes is retained. Recognized keywords are (case-insensitive):\n --> 'Fold=<value>': to specify the extent to which this conformational coordinate should be explored (e.g., 2-fold, 3-fold, etc)\n --> 'GetCurrentValue': requests the determination of the value of the internal coordinate defined by the tuple: distance, angle, or dihedral angle.\n --> 'Value=<number>': to specify a value to assign to the conformational coordinate independently from the current value.\n --> 'Steps=[<int>,...]': to specify which steps to take along this kind of conformational coordinate. The magnitude of the step is defined by the fold. For example, a torsion-kind of coordinate with fold=4 has the step length is 90 DEG, so Steps=[2,3] specifies to twist the corresponding bond by 180 and 270 DEG. By defaule no step is specifies, meaning that all steps will be considered.\n --> 'OnlyBonded': limits to tuples of atoms to those that are connected to form a path visiting the tuple in the orded given by the order of the indexes. For example, creates a conformational coordinate on angle '0 1 2' only if atom 0 is connected with any bond to atom 1, which is connected with any bond to atom 2.\n --> 'getAtomLabels': request the generation of formatted atom labels to be used when reporting the atom tuple defined by the specific rule that contains this keyword. This keyword activates all the keywords associated with the 'GenerateAtomLabels' task.\n --> 'Prefix=<text with spaces>': to specify a text to be placed before the list of atom indexes.\n --> 'Suffix=<text with spaces>': to specify text to be placed after the list of atom indexes)."
  },
  {
    "embeddedWorker": "autocompchem.molecule.AtomContainerInputProcessor",
    "tag": "the importing of chemical objects (e.g., molecular geometries)"
  }
]
